# WorksetFilter Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetFilter Class
Members See Also
---
A base class for a type of filter that accepts or rejects worksets based upon criteria.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class WorksetFilter : IDisposable
```

Visual Basic
---
```text
Public Class WorksetFilter _
	Implements IDisposable
```

Visual C++
---
```text
public ref class WorksetFilter : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..WorksetFilter Autodesk.Revit.DB..::..WorksetKindFilter
# See Also
WorksetFilter Members
Autodesk.Revit.DB Namespace